#include <stdio.h>
#include<windows.h>
int main()//比较3个数的大小
{
    int a,b,c,d;
     system ("color a");
    	printf(">>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n");
    	printf("请输入第一个数:");
			scanf("%d",&a);
		printf("请输入第二个数:");
			scanf("%d",&b);
		printf("请输入第三个数:");
			scanf("%d",&c);
		//---------------------------------------------
				if(a>=b)
				    {
				     d=a;       
				    }
				else
				    {
				     d=b;   
				    }
		//--------------第一步比较完成------------------
		//--------------第二步比较开始------------------
				if(d>=c)
				    {
				     printf("最大的数是:%d\n", d);
				    }
				else
				    {
				     printf("最大的数是%d\n", c);
				    }
		//--------------------------------------------
    	printf(">>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\n");
     Sleep(5000);
    return 0;
}
