#include <stdio.h>
#include <windows.h>
int main()
{
	int a,b,c;//a作为第一个数,b作为第二个数,c作为中间变量.
	system ("color a");
   		printf("==============================================================================\n");
   		printf("请输入第一个数: ");
   	scanf ("%d",&a);
   		printf("请输入第二个数: ");
   	scanf ("%d",&b);
   	//----------开始交换数据.
		c=a;
		a=b;
		b=c;
	//----------数据交换结束.
		printf("您输入的第一个数为: %d,交换之后变成了: %d.\n",c,a );
		printf("您输入的第二个数为: %d,交换之后变成了: %d.\n",a,c );
		printf("==============================================================================\n");
	Sleep (5000);
    return 0;
}
