二、分析题
1． 以下程序的输出结果是( 20 )。
main()
{
    int n=4;
    while (n--)
        printf(〞%d〞,--n)；
}

2． 以下程序的输出结果是(101091  )。
main()
{
    int x=10,y=10,i;
    for(i=0;x>8;y=++i)
        printf("%d%d",x--,y);
}

3． 当执行以下程序段时。A
x=-1；
do
{x=x*x；}
while (!x)；
A.循环体将执行一次　　             　　　　B.循环体将执行两次
C.循环体将执行无数多次　　　             　D.系统将提示有语法错误

4． 执行以下程序后输出的结果是（ 0  ）。
main()
{
    int y=10;
    do{y--;}while(--y);
    printf("%d\n",y--);}

5． 下面程序的输出结果是（ x=5,y=4,a=1  ）。
main()
{
    int x=3,y=6,a=0;
    while (x++!=(y-=1))
    {a+=1;
        if (y<x) break;
    }
    printf("x=%d,y=%d,a=%d\n",x,y,a);
}

6．若i,j已定义为int类型，则以下程序段中内循环的总的执行次数是 （ 20 ）。
for (i=5；i；i--)
for (j=0；j<4；j++)
{…}


7．在下列选项中，没有构成死循环的程序段是（  D ）。
A.int i=100；
while (1)
{
    i=i%100+1；
    if(i>100) break；
}
B. for ( ； ；)；

C.int k=1000；
do {++k；}while (k>=10000)；

D.int s=36；
while (s) ;
--s；

8．列程序运行的情况是（ A ）。
main()
{
    int i=1,sum=0;
    while(i<10)sum=sum+1;i++;
    printf("i=%d,sum=%d",i,sum);
}
A.i=10,sum=9      B.i=9,sum=9      C.i=2,sum=1          D.运行出现错误

9．下面程序的运行结果为（ 0 2 4 6 ）。
main()
{
    int n;
    for(n=1;n<=10;n++)
    { if(n%3==0)continue;
        printf("%d",n);
    }
}

10.输出结果？  12457810
#include <stdio.h>
int main()
{
    for (int i = 0; i<10; i++) {
        if (i % 2) continue;
        if (i == 8) break;
        printf("i=%d\n", i);
    }
    return 0;
}

11.输出结果？
#include <stdio.h>
int main()
{
    for (int i = 0; i<5; i++) {
        for (int j = 0; j<5; j++) {
            printf("i=%d, j=%d\n", i, j);
            if (j == 1) {
                break;
            }
        }
        if (i == 2) {
            break;
        }
    }
    return 0;
}
=====================
i=0,j=0
I=0,j=1
i=1,j=0
i=1,j=1
i=2,j=0
i=2,j=1
=====================

三、编程题
1.
/*
 打印1 - 100中不能被7整除又不包含7的数
 */
----------------------------------------------------------------
#include <stdio.h>
int main()
{
int	 i=0;
int 	count =0;
for (int i = 1;i<=100 ; i++)
        {
        	if(i%7 != 0 && i % 10 !=7 && (int)(i/10) !=7)
        	    {
        	       ++count;
        	    }
printf(“一共有%d个”,count);
        }
        return 0;
}
------------------------------------------------------------------
2.
/*
 输入两个数，求最小公倍数和最大公约数
 */
-----------------------------------------------------------------
int divisor (int a,int b)    /*自定义函数求两数的最大公约数*/
{
  int  temp;          /*定义整型变量*/
  if(a<b)             /*通过比较求出两个数中的最大值和最小值*/
    { temp=a;a=b;b=temp;} /*设置中间变量进行两数交换*/
   while(b!=0)           /*通过循环求两数的余数，直到余数为0*/
    {
      temp=a%b;
      a=b;              /*变量数值交换*/
      b=temp;
    }
  return (a);            /*返回最大公约数到调用函数处*/ 
}
int multiple (int a,int b)  /*自定义函数求两数的最小公倍数*/
{
  int divisor (int a,int b); /*自定义函数返回值类型*/
  int temp;
  temp=divisor(a,b);  /*再次调用自定义函数，求出最大公约数*/
  return  (a*b/temp); /*返回最小公倍数到主调函数处进行输出*/
}
#include <stdio.h>   
int main()  
{
    int m,n,t1,t2;     /*定义整型变量*/
      printf("请输入两个数,中间用空格隔开:"); /*提示输入两个整数*/
      scanf("%d %d",&m,&n);              /*通过终端输入两个数*/
      t1=divisor(m,n);                    /*自定义主调函数*/
      t2=multiple(m,n);                 /*自定义主调函数*/
      printf("最大公约数是 %d\n",t1);  /*输出最大公约数*/
      printf("最小公倍数是 %d\n", t2);  /*输出最小公倍数*/
  return 0;
-----------------------------------------------------------------------------
3.
/*
 编程将所有“水仙花数”打印出来，并打印其总个数。 “水仙花数”是一个 各个位立方之和等于该整数的三位数。
 */
---------------------------------------------------------------------------------
#include <stdio.h>
int sancifang(int a)//计算三次方的函数
{
    int num=0;
    num=a*a*a;
    return num;
}

int main()// 判断一个数是不是水仙花数
{
    int number0=0;
    int number1=0;//number0和1都是相同的数,number1用来运算
    int moded=0;
    int sum=0;

    printf("请输入一个三位数:");
    scanf("%d",&number1);
    number0=number1;
    	while(number1!=0)
    	    {
    			moded=number1%10;//获取输入数的最后一位
    			sum=sancifang(moded)+sum;
    			number1=number1/10;//剔除最后一位,变成新的数

    	    }
    	if(sum==number0)//判断是不是水仙花数
    	    {
    	            printf("这是个水仙花数!\n");		
    	    }
    	else
    	    {
    	            printf("这不是水仙花数!\n");
    	    }
    	
    return 0;
}
-----------------------------------------------------------------------------------------
4.
/*
 题目：提示用户输入一个正整数n，利用while循环计算并输出：1-2+3-4+5-6+7…+n的和
 */
----------------------------------------------------------------------------------------
#include <stdio.h>
int main()
{
	int  i=0; 
	int n=0;
	int sum=0;
	int ji_shu=1;
	int ou_shu=0;
	scanf ("%d",&n);
	while(i<=n)
	   {
	     ou_shu=ou_shu+i;
	     i=i+2;
	   }
	i=0;
	while(i<=n)
	        {
	          ji_shu=ji_shu+i;
	          i=i+3;
	        }
	sum=ji_shu - ou_shu;
	printf ( "%d\n" , sum );
    return 0;
}
-----------------------------------------------------------------------------------------------
5.
/*
 题目：提示用户输入一个正整数n，计算并输出n的阶乘结果：1*2*3*…*n
 */
---------------------------------------------------------------------------------------------------
#include <stdio.h>
int main()
{
	//计算从1乘到N的程序
	     int chengji=1,i=0,n;
     
     printf("请输入一个数字: ");
     	scanf("%d",&n);
     	 while(i<=n)
     	     {
     	        chengji=chengji*i;
                i=i+1;                
     	     }
     	printf("%d!=%d,n,chengji);
    return 0;
}
------------------------------------------------------------------------------------------
6.
/*
 题目：提示用户输入一个正整数n，如果n是5，就输出下列图形，其他n值以此类推
 *
 **
 ***
 ****
 *****
 */
--------------------------------------------------------------------
#include <stdio.h>
int main()
{
    int num;
    printf("请输入一个数: ");
    scanf("%d",&num);
    for (int i = 1; i <=num; i++)
    {
    	printf("\n");
    	for (int j = 1; j<i; j++)
    	{
    		printf("*");
    	}
    	printf("*");
    }
    printf("\n");
    return 0;
}
----------------------------------------------------------------
7.
/*
 题目：提示用户输入一个小于10的正整数n，如果n是5，就输出下列图形，其他n值以此类推
 1
 22
 333
 4444
 55555
 */
----------------------------------------------------------------------
#include <stdio.h>
int main()
{
    int num;
    printf("请输入一个数: ");
    scanf("%d",&num);
    for (int i = 1; i <=num; i=i+2)
    {
    	printf("\n");
    	for (int j = 1; j<i; j++)
    	{
    		printf("%d\n",j);
    	}
    	printf("\n");
    }
    printf("\n");
    return 0;
}
---------------------------------------------------------------------------

8.
/*
 题目：提示用户输入一个小于10的正整数n，如果n是5，就输出下列图形，其他n值以此类推
 54321
 5432
 543
 54
 5
 */
-------------------------------------------------------------------------------
#include <stdio.h>
int main()
{
    int num=0;
    printf("请输入一个数:");
    scanf("%d",&num);
    for (int i = 0; i <=num; i++)
    {
    	for (int j = num; j >i ; j--)
    	{
    		printf("%d", j);
    	}
    	printf("\n");
    }
    return 0;
}
---------------------------------------------------------------------------------
9.
/*
 使用循环打印三角形
---*
--***
-*****
*******
 */
------------------------------------------------
#include <stdio.h>
int main()
{
    int num;
    printf("请输入一个数: ");
    scanf("%d",&num);
    for (int i = 1; i <=num; i=i+2)
    {
    	printf("\n");
    	for (int j = 1; j<i; j++)
    	{
    		printf("*");
    	}
    	printf("*");
    }
    printf("\n");
    return 0;
}
--------------------------------------------------
10.
/*
 求S(n) = a+aa+aaa+aaaa+...+aa..a之值，其中a是一个数字，n表示a的位数例如：2+22+222+2222+22222(此时n=5)，n和a都从键盘输入。

 */
--------------------------------------------------------------------
#include<stdio.h>
 int main()
 { 
 	int a,n,count=1;
    long int sn=0,tn=0;
    printf("请输入a和n的值,并用空格隔开:");
    scanf("%d%d",&a,&n);
    printf("a=%d,n=%d\n",a,n);
  	while(count<=n)
       { tn=tn+a;
         sn=sn+tn;
         a=a*10;
         ++count;
       }
       printf("a+aa+...=%ld\n",sn);
       return 0;
 }
---------------------------------------------------------------------
11.
/*
 猴子吃桃问题。猴子第一天摘下若干个桃子，当即吃了一半，还不过瘾，又多吃了一个。第二天早上又将剩下的桃子吃掉一半，又多吃一个。以后每天早上都吃了前一天剩下的一半零一个。到第10天早上想再吃时，就只剩一个桃子了。求第一天共摘多少个桃子。
 */
-----------------------------------------------------------------------
#include <stdio.h>
 int main()
 {
     int total=0;//第一天共计摘的桃子
     int i=10;//第i天吃的桃子
     for (i = 10; i >0; i--)
     {
     	total=total*2+1;
     }
     printf("一共有%d个桃子\n",total );
     return 0;
 }
--------------------------------------------------------------------------
12.
/*
 如果要将整钱换成零钱，那么一元钱可兑换成一角、两角、五角，问有多少种兑换方式
*/
---------------------------------------------------------------------------
#include <stdio.h>
 int fangshi();
 int main()
 {
    	fangshi();
 		system ("pause");
     return 0;
 }
 int fangshi()
 {
 	int wu_jiao=5;
 	int e_jiao=2;
 	int yi_jiao=1;
 	int count =0;//计数
 	for (yi_jiao = 0; yi_jiao <=10; yi_jiao++)//因为是1角,所以最大值是10
 	{
 		for (e_jiao = 0; e_jiao <=5; e_jiao++)//因为是2角,所以最大值是5
 		{
 			for (wu_jiao = 0; wu_jiao <=2; wu_jiao++)//因为是5角,所以最大值是2
 			{
 				if((yi_jiao+e_jiao*2+wu_jiao*5)==10)
 				    {
 				          count++;
 				        //printf("0.1*%d+0.2*%d+0.5*%d\n", yi_jiao,e_jiao,wu_jiao);
 				    }
 				
 			}
 		}
 	}
 	printf("一共有%d种方案\n",count);
 	return 0;
 }
---------------------------------------------------------------------------------------------------
13.
/*
 打印九九乘法表
*/

---------------------------------------------------------------------------------------------------
#include <stdio.h>
int main()
{
	for (int i = 1; i <=9; i++)
	{
		printf("\n");
		for (int j = 1; j <=i; j++)
		{
			printf("%d*%d=%d\t ", j,i,i*j);//
		}
	}
	printf("\n");
    return 0;
}
---------------------------------------------------------------------------------------------------
14.
/*
 一农户在集市上卖西瓜，他总共有1020个西瓜，第一天卖掉一半多两个，第二天卖掉剩下的一个多两个，问照此规律卖下去，该农户几天能将所有的西瓜卖完？
 */
---------------------------------------------------------------------------------------------------
#include <stdio.h>
 int main()
 {
     int total =1020;
     int day=0;
     for (total = 1020; total >0; day++)
     {
       total=total/2-2;
       printf("total=%d\n", total);
     }
     printf("day=%d\n", day);
     return 0;
 }
---------------------------------------------------------------------------------------------------
15.
/*
 假设银行当前整存领取五年期的年利息为2.5%，现在某人手里有一笔钱，预计在今后的五年当中每年年底取出1000，到第五年的时候刚好取完，计算在最开始存钱的时候要存多少钱？
 */
---------------------------------------------------------------------------------------------------
#include<stdio.h>
int work(int x)
{
	for(int i=0;i<5;i++)
	{
    	x=x+x/50+x/200;
    	x-=1000;
	}
	return x;
}
int main()
{
	int i=0;
	for(i=0;i<=10000;i++)
	{
    	if(work(i)==0)
    	{
    	printf("%d",i);
		}
	}
	return 0;
}
---------------------------------------------------------------------------------------------------
16.
/*
 假设一个班中有20个学生，输入某科考试的成绩然后统计出该班不及格的学生人数
*/
#include <stdio.h>
int main()
{
    int score=0;
    int count=0;
    for (int i = 1; i <= 20; i++)
    {
    	printf("请输入第%d个学生的成绩:", i);
    	scanf("%d",&score);
    	if(score<60)
    	    {
    	      count++;      
    	    }
    	
    }
    printf("不及格的有%d个\n",count);
    return 0;
}
